using UnityEngine;
using System.Collections;

namespace WonderGame
{
    public class ShowFPS : MonoBehaviour
    {
        #region 内部数据
        private float fUpdateInterval = 0.5f;
        private float fLastInterval = 0f;
        private int iFrames = 0;
        private float fFps = 0f;
        private GUIStyle mStyle = null;
        #endregion
        /* ============================================================================================================================*/
        /** @brief: -------------------------------------------内部函数--------------------------------------------------------------- */
        /** @brief: -------------------------------------------内部函数--------------------------------------------------------------- */
        /** @brief: -------------------------------------------内部函数--------------------------------------------------------------- */
        /** @brief: -------------------------------------------内部函数--------------------------------------------------------------- */
        /** @brief: -------------------------------------------内部函数--------------------------------------------------------------- */
        /* ============================================================================================================================*/

        #region 初始化字体信息
        /************************************
         * 函数说明: 初始化字体信息
         * 返 回 值: void
         * 注意事项: 
        ************************************/
        void Start()
        {
            mStyle = new GUIStyle();
            //mStyle.font = CustomFont.GetCustomFont.dynamicFont;
            mStyle.fontSize = 40;
            mStyle.normal.textColor = Color.white;
        }
        #endregion

        #region 显示当前的FPS
        /************************************
         * 函数说明: 显示当前的FPS
         * 返 回 值: void
         * 注意事项: 
        ************************************/
        void OnGUI()
        {
            if (fFps > 20f)
            {
                mStyle.normal.textColor = Color.green;
            }
            else
            {
                mStyle.normal.textColor = Color.red;
            }
            GUILayout.Label("FPS : " + fFps.ToString("f2"), mStyle);
        }
        #endregion

        #region 后台刷新
        /************************************
		 * 函数说明: 后台刷新
		 * 返 回 值: void
		 * 注意事项: 
		************************************/
        void Update()
        {
            iFrames++;
            float fTimeNow = Time.realtimeSinceStartup;
            if (fLastInterval > fTimeNow)
            {
                fLastInterval = fTimeNow;
            }
            if (fTimeNow > (fLastInterval + fUpdateInterval))
            {
                fFps = iFrames * 1.0f / (fTimeNow - fLastInterval);
                iFrames = 0;
                fLastInterval = fTimeNow;
            }
            //Debug.Log("Time " + fTimeNow + " LastInterval :" + fLastInterval);
        }
        #endregion

        /* ============================================================================================================================*/
        /** @brief: -------------------------------------------外部函数--------------------------------------------------------------- */
        /** @brief: -------------------------------------------外部函数--------------------------------------------------------------- */
        /** @brief: -------------------------------------------外部函数--------------------------------------------------------------- */
        /** @brief: -------------------------------------------外部函数--------------------------------------------------------------- */
        /** @brief: -------------------------------------------外部函数--------------------------------------------------------------- */
        /* ============================================================================================================================*/

        #region 显示FPS信息
        /************************************
         * 函数说明: 显示FPS信息
         * 返 回 值: void
         * 注意事项: 
        ************************************/
        public static void Show()
        {
            //TODO
        }
        #endregion
    }
}

